04_Simulation/PH_2D_RANS_kOmegaSSTx/0/I02
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I02;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
32000
(
-0.048047329
-0.048049982
-0.047977592
-0.047467217
-0.045937611
-0.042848449
-0.038164504
-0.032956695
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
-0.04805
-0.04805
-0.04805
-0.04805
-0.04805
-0.04805
-0.04805
-0.04805
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
-0.048047329
-0.048049982
-0.047977592
-0.047467217
-0.045937611
-0.042848449
-0.038164504
-0.032956695
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
