04_Simulation/PH_2D_RANS_kOmegaSSTx/0/I04
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I04;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
32000
(
1.3086704e-05
1.083906e-06
-6.8042399e-05
-0.00019098361
-0.00035188773
-0.00051505105
-0.00063242292
-0.00067481476
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
0
0
2.0444049e-21
2.0444061e-21
-2.0444095e-21
0
1.2247968e-17
-1.2247968e-17
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
1.3086704e-05
1.083906e-06
-6.8042399e-05
-0.00019098361
-0.00035188773
-0.00051505105
-0.00063242292
-0.00067481476
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
