04_Simulation/PH_2D_RANS_kOmegaSSTx/0/I05
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      I05;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<scalar> 
32000
(
-0.0011543086
-0.0011544006
-0.0011518897
-0.0011342525
-0.0010820871
-0.00097990547
-0.00083306331
-0.00068124562
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
-0.0011544012
-0.0011544012
-0.0011544013
-0.0011544013
-0.0011544012
-0.0011544012
-0.0011544012
-0.0011544012
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<scalar> 
200
(
-0.0011543086
-0.0011544006
-0.0011518897
-0.0011342525
-0.0010820871
-0.00097990547
-0.00083306331
-0.00068124562
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
