04_Simulation/PH_2D_RANS_kOmegaSSTx/0/RB
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      RB;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   nonuniform List<symmTensor> 
32000
(
(6.8478827e-11 -1.7187159e-10 -0 6.6666667e-11 -0 6.6666667e-11)
(6.6816757e-11 -1.7188368e-10 -1.0686627e-25 6.6666667e-11 -0 6.6666667e-11)
(5.7225421e-11 -1.7184666e-10 -1.0677975e-25 6.6666667e-11 -0 6.6666667e-11)
(3.9763473e-11 -1.7168491e-10 -5.3352331e-26 6.6666667e-11 -0 6.6666667e-11)
(1.4710749e-11 -1.7132362e-10 -5.3457974e-26 6.6666667e-11 -0 6.6666667e-11)
(-1.7438078e-11 -1.7068943e-10 -5.3204635e-26 6.6666667e-11 -0 6.6666667e-11)
(-5.5483435e-11 -1.6971077e-10 -5.3168364e-26 6.6666667e-11 -0 6.6666667e-11)
(-9.4431328e-11 -1.6832739e-10 -0 6.6666667e-11 -0 6.6666667e-11)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(6.6666667e-11 3.4374031e-10 2.1371053e-25 6.6666667e-11 -0 6.6666667e-11)
(6.6666667e-11 3.4376347e-10 2.137332e-25 6.6666667e-11 -0 6.6666667e-11)
(6.6666667e-11 3.4365387e-10 -0 6.6666667e-11 -0 6.6666667e-11)
(6.6666667e-11 3.4322639e-10 3.7539022e-32 6.6666667e-11 -0 6.6666667e-11)
(6.6666667e-11 3.4230675e-10 -7.267474e-32 6.6666667e-11 -0 6.6666667e-11)
(6.6666667e-11 3.4074883e-10 1.3811171e-31 6.6666667e-11 -0 6.6666667e-11)
(6.6666667e-11 3.3846162e-10 -2.1040716e-25 6.6666667e-11 -0 6.6666667e-11)
(6.6666667e-11 3.3546e-10 -3.7973002e-29 6.6666667e-11 -0 6.6666667e-11)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(7.0290966e-11 -3.437411e-10 -8.4841756e-30 6.6666667e-11 -0 6.6666667e-11)
(6.6966845e-11 -3.4376528e-10 -1.0686733e-25 6.6666667e-11 -0 6.6666667e-11)
(4.7784289e-11 -3.4369125e-10 -1.0677975e-25 6.6666667e-11 -0 6.6666667e-11)
(1.28606e-11 -3.4336778e-10 -5.3216293e-26 6.6666667e-11 -0 6.6666667e-11)
(-3.7244563e-11 -3.4264525e-10 -5.3457974e-26 6.6666667e-11 -0 6.6666667e-11)
(-1.0154188e-10 -3.4137695e-10 -5.3760237e-26 6.6666667e-11 -0 6.6666667e-11)
(-1.7763225e-10 -3.3941976e-10 -5.3168364e-26 6.6666667e-11 -0 6.6666667e-11)
(-2.5552774e-10 -3.3665313e-10 -0 6.6666667e-11 -0 6.6666667e-11)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
