04_Simulation/PH_2D_RANS_kOmegaSSTx/0/T01
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      T01;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
32000
(
(-0.0010894844 0.15499569 0 0.00054474219 0 0.00054474219)
(-9.023154e-05 0.15499997 9.6369063e-17 4.511577e-05 0 4.511577e-05)
(0.0056728481 0.15488317 9.623921e-17 -0.0028364241 0 -0.0028364241)
(0.016093938 0.15405716 4.7874379e-17 -0.0080469691 0 -0.0080469691)
(0.030640491 0.15155463 4.728947e-17 -0.015320245 0 -0.015320245)
(0.048081185 0.14637016 4.5624214e-17 -0.024040592 0 -0.024040592)
(0.066283888 0.13813852 4.3277154e-17 -0.033141944 0 -0.033141944)
(0.081903208 0.12836802 0 -0.040951604 0 -0.040951604)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(0 -0.155 -9.6366737e-17 0 0 0)
(0 -0.155 -9.6370465e-17 0 0 0)
(-1.701898e-19 -0.155 0 8.5094899e-20 0 8.5094899e-20)
(-1.7018989e-19 -0.155 -1.6952509e-23 8.5094947e-20 0 8.5094947e-20)
(1.7019018e-19 -0.155 3.2907866e-23 -8.5095088e-20 0 -8.5095088e-20)
(0 -0.155 -6.2824326e-23 0 0 0)
(-1.0196019e-15 -0.155 9.635689e-17 5.0980094e-16 0 5.0980094e-16)
(1.0196019e-15 -0.155 1.7545505e-20 -5.0980094e-16 0 -5.0980094e-16)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(-0.0010894844 0.15499569 3.8255846e-21 0.00054474219 0 0.00054474219)
(-9.023154e-05 0.15499997 4.8185301e-17 4.511577e-05 0 4.511577e-05)
(0.0056728481 0.15488317 4.8119895e-17 -0.0028364241 0 -0.0028364241)
(0.016093938 0.15405716 2.3876296e-17 -0.0080469691 0 -0.0080469691)
(0.030640491 0.15155463 2.3644873e-17 -0.015320245 0 -0.015320245)
(0.048081185 0.14637016 2.3050457e-17 -0.024040592 0 -0.024040592)
(0.066283888 0.13813852 2.1638691e-17 -0.033141944 0 -0.033141944)
(0.081903208 0.12836802 0 -0.040951604 0 -0.040951604)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
