04_Simulation/PH_2D_RANS_kOmegaSSTx/0/T02
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      T02;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
32000
(
(-0.048047329 -0.00025329808 0 0.048047329 0 0)
(-0.048049982 -2.0978829e-05 -1.3043294e-20 0.048049982 2.9874404e-17 1.8573993e-32)
(-0.047977592 0.001317943 8.1892563e-19 0.047977592 2.9811668e-17 1.8523971e-32)
(-0.047467217 0.0037190796 1.1557309e-18 0.047467217 1.4750782e-17 4.5839122e-33)
(-0.045937611 0.0069655622 2.1734588e-18 0.045937611 1.4333876e-17 4.472588e-33)
(-0.042848449 0.010556476 3.2904994e-18 0.042848449 1.3356047e-17 4.1631377e-33)
(-0.038164504 0.013734538 4.3028671e-18 0.038164504 1.1956485e-17 3.7458242e-33)
(-0.032956695 0.015770628 0 0.032956695 0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(-0.04805 0 0 0.04805 2.9873688e-17 1.8573096e-32)
(-0.04805 0 0 0.04805 2.9874844e-17 1.8574533e-32)
(-0.04805 3.9569128e-20 0 0.04805 0 0)
(-0.04805 3.956915e-20 4.3277185e-42 0.04805 5.2552778e-24 5.7477511e-46)
(-0.04805 -3.9569216e-20 8.4008933e-42 0.04805 -1.0201438e-23 2.1658553e-45)
(-0.04805 0 0 0.04805 1.9475541e-23 7.8937918e-45)
(-0.04805 2.3705744e-16 -1.473685e-31 0.04805 -2.9870636e-17 1.8569301e-32)
(-0.04805 -2.3705744e-16 2.6834145e-35 0.04805 -5.4391066e-21 6.1568951e-40)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(-0.048047329 -0.00025329808 -6.251872e-24 0.048047329 1.1858983e-21 2.9270196e-41)
(-0.048049982 -2.0978829e-05 -6.5217509e-21 0.048049982 1.493744e-17 4.6436464e-33)
(-0.047977592 0.001317943 4.0946528e-19 0.047977592 1.4905924e-17 4.6310485e-33)
(-0.047467217 0.0037190796 5.7639546e-19 0.047467217 7.3566288e-18 1.1401551e-33)
(-0.045937611 0.0069655622 1.0867358e-18 0.045937611 7.1669799e-18 1.11816e-33)
(-0.042848449 0.010556476 1.6624399e-18 0.042848449 6.7477982e-18 1.0626471e-33)
(-0.038164504 0.013734538 2.1514449e-18 0.038164504 5.9782737e-18 9.364659e-34)
(-0.032956695 0.015770628 0 0.032956695 0 0)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
