04_Simulation/PH_2D_RANS_kOmegaSSTx/0/T03
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      T03;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
32000
(
(0.0080084817 -8.4432693e-05 0 0.0080075915 0 -0.016016073)
(0.0080083344 -6.992943e-06 -4.3477645e-21 0.0080083282 1.4937202e-17 -0.016016663)
(0.008012356 0.00043931435 2.7297521e-19 0.0079882201 1.4905834e-17 -0.016000576)
(0.0080407102 0.0012396932 3.8524365e-19 0.0078464491 7.3753908e-18 -0.015887159)
(0.0081256883 0.0023218541 7.2448628e-19 0.0074215585 7.1669381e-18 -0.015547247)
(0.0082973084 0.0035188254 1.0968331e-18 0.0065634581 6.6780236e-18 -0.014860767)
(0.0085575276 0.0045781792 1.434289e-18 0.0052623622 5.9782423e-18 -0.01381989)
(0.0088468503 0.0052568762 0 0.0038157487 0 -0.012662599)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(0.0080083333 -0 -0 0.0080083333 1.4936844e-17 -0.016016667)
(0.0080083333 -0 -0 0.0080083333 1.4937422e-17 -0.016016667)
(0.0080083333 1.3189709e-20 0 0.0080083333 0 -0.016016667)
(0.0080083333 1.3189717e-20 1.4425728e-42 0.0080083333 2.6276389e-24 -0.016016667)
(0.0080083333 -1.3189739e-20 2.8002978e-42 0.0080083333 -5.1007192e-24 -0.016016667)
(0.0080083333 -0 -0 0.0080083333 9.7377705e-24 -0.016016667)
(0.0080083333 7.9019146e-17 -4.9122834e-32 0.0080083333 -1.4935318e-17 -0.016016667)
(0.0080083333 -7.9019146e-17 8.9447151e-36 0.0080083333 -2.7195533e-21 -0.016016667)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(0.0080084817 -8.4432693e-05 -2.0839573e-24 0.0080075915 5.9294914e-22 -0.016016073)
(0.0080083344 -6.992943e-06 -2.173917e-21 0.0080083282 7.4687202e-18 -0.016016663)
(0.008012356 0.00043931435 1.3648843e-19 0.0079882201 7.4529618e-18 -0.016000576)
(0.0080407102 0.0012396932 1.9213182e-19 0.0078464491 3.6783144e-18 -0.015887159)
(0.0081256883 0.0023218541 3.6224525e-19 0.0074215585 3.5834899e-18 -0.015547247)
(0.0082973084 0.0035188254 5.5414663e-19 0.0065634581 3.3738991e-18 -0.014860767)
(0.0085575276 0.0045781792 7.1714828e-19 0.0052623622 2.9891369e-18 -0.01381989)
(0.0088468503 0.0052568762 0 0.0038157487 0 -0.012662599)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
