04_Simulation/PH_2D_RANS_kOmegaSSTx/0/T04
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      T04;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
32000
(
(-0.0080078882 0 0 -0.0080078882 0 0.016015776)
(-0.0080083303 0 0 -0.0080083303 -1.4937202e-17 0.016016661)
(-0.0079962654 0 0 -0.0079962654 -1.4905834e-17 0.015992531)
(-0.0079112028 0 0 -0.0079112028 -7.3753908e-18 0.015822406)
(-0.0076562685 0 0 -0.0076562685 -7.1669381e-18 0.015312537)
(-0.0071414082 0 0 -0.0071414082 -6.6780236e-18 0.014282816)
(-0.0063607507 0 0 -0.0063607507 -5.9782423e-18 0.012721501)
(-0.0054927825 0 0 -0.0054927825 0 0.010985565)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(-0.0080083333 0 0 -0.0080083333 -1.4936844e-17 0.016016667)
(-0.0080083333 0 0 -0.0080083333 -1.4937422e-17 0.016016667)
(-0.0080083333 0 0 -0.0080083333 0 0.016016667)
(-0.0080083333 0 0 -0.0080083333 -2.6276389e-24 0.016016667)
(-0.0080083333 0 0 -0.0080083333 5.1007192e-24 0.016016667)
(-0.0080083333 0 0 -0.0080083333 -9.7377705e-24 0.016016667)
(-0.0080083333 0 0 -0.0080083333 1.4935318e-17 0.016016667)
(-0.0080083333 0 0 -0.0080083333 2.7195533e-21 0.016016667)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(-0.0080078882 0 0 -0.0080078882 -5.9294914e-22 0.016015776)
(-0.0080083303 0 0 -0.0080083303 -7.4687202e-18 0.016016661)
(-0.0079962654 0 0 -0.0079962654 -7.4529618e-18 0.015992531)
(-0.0079112028 0 0 -0.0079112028 -3.6783144e-18 0.015822406)
(-0.0076562685 0 0 -0.0076562685 -3.5834899e-18 0.015312537)
(-0.0071414082 0 0 -0.0071414082 -3.3738991e-18 0.014282816)
(-0.0063607507 0 0 -0.0063607507 -2.9891369e-18 0.012721501)
(-0.0054927825 0 0 -0.0054927825 0 0.010985565)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
