04_Simulation/PH_2D_RANS_kOmegaSSTx/0/T05
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      T05;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
32000
(
(-2.6173407e-05 -1.3798215e-07 0 2.6173407e-05 0 0)
(-2.1678119e-06 -9.4647603e-10 -5.8845823e-25 2.1678119e-06 1.3478067e-21 8.3797999e-37)
(0.0001360848 -3.7382454e-06 -2.3228204e-21 -0.0001360848 -8.4558531e-20 -5.2541837e-35)
(0.00038196723 -2.9927319e-05 -9.3001312e-21 -0.00038196723 -1.1869908e-19 -3.68866e-35)
(0.00070377546 -0.00010671412 -3.3297923e-20 -0.00070377546 -2.195985e-19 -6.8521145e-35)
(0.0010301021 -0.00025378394 -7.9105553e-20 -0.0010301021 -3.2108729e-19 -1.000843e-34)
(0.0012648458 -0.00045518928 -1.4260538e-19 -0.0012648458 -3.9626114e-19 -1.2414389e-34)
(0.0013496295 -0.00064583253 0 -0.0013496295 0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(0 0 0 -0 -0 -0)
(0 0 0 -0 -0 -0)
(-4.0888099e-21 0 0 4.0888099e-21 0 0)
(-4.0888122e-21 0 9.1835496e-41 4.0888122e-21 4.4719758e-43 4.8910458e-65)
(4.088819e-21 0 9.1835496e-41 -4.088819e-21 8.680923e-43 -1.8430365e-64)
(0 0 0 -0 -0 -0)
(-2.4495935e-17 0 0 2.4495935e-17 -1.5228078e-32 9.466647e-48)
(2.4495935e-17 0 -4.7019774e-38 -2.4495935e-17 2.7728617e-36 -3.1387909e-55)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(-2.6173407e-05 -1.3798215e-07 -3.4056584e-27 2.6173407e-05 6.4600882e-25 1.594471e-44)
(-2.1678119e-06 -9.4647603e-10 -2.9423381e-25 2.1678119e-06 6.7391413e-22 2.0950169e-37)
(0.0001360848 -3.7382454e-06 -1.1614172e-21 -0.0001360848 -4.227952e-20 -1.3135617e-35)
(0.00038196723 -2.9927319e-05 -4.6382365e-21 -0.00038196723 -5.9198565e-20 -9.1747926e-36)
(0.00070377546 -0.00010671412 -1.6649058e-20 -0.00070377546 -1.0979989e-19 -1.7130486e-35)
(0.0010301021 -0.00025378394 -3.996604e-20 -0.0010301021 -1.6222107e-19 -2.5546666e-35)
(0.0012648458 -0.00045518928 -7.1303064e-20 -0.0012648458 -1.9813161e-19 -3.10363e-35)
(0.0013496295 -0.00064583253 0 -0.0013496295 0 0)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
