04_Simulation/PH_2D_RANS_kOmegaSSTx/0/T06
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      T06;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
32000
(
(3.0535642e-05 -0.0037234955 0 -3.4897876e-05 0 -8.7244691e-06)
(2.5291139e-06 -0.0037238724 -2.3152656e-18 -2.8904159e-06 -1.3478067e-21 -7.2260398e-07)
(-0.0001587656 -0.0037135917 -2.3075014e-18 0.0001814464 8.4558531e-20 4.5361599e-05)
(-0.00044562843 -0.0036413686 -1.1315817e-18 0.00050928964 1.1869908e-19 0.00012732241)
(-0.00082107137 -0.0034276717 -1.0695337e-18 0.00093836729 2.195985e-19 0.00023459182)
(-0.0012017858 -0.0030089753 -9.3791063e-19 0.0013734695 3.2108729e-19 0.00034336737)
(-0.0014756535 -0.0024083995 -7.5452288e-19 0.0016864611 3.9626114e-19 0.00042161528)
(-0.0015745678 -0.0017923765 0 0.001799506 0 0.00044987651)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(-0 0.003723875 2.3152109e-18 0 0 0)
(-0 0.003723875 2.3153004e-18 0 0 0)
(4.7702782e-21 0.003723875 0 -5.4517465e-21 0 -1.3629366e-21)
(4.7702809e-21 0.003723875 4.0728403e-25 -5.4517496e-21 -4.4719758e-43 -1.3629374e-21)
(-4.7702888e-21 0.003723875 -7.9061148e-25 5.4517586e-21 -8.680923e-43 1.3629397e-21)
(-0 0.003723875 1.5093544e-24 0 0 0)
(2.8578591e-17 0.003723875 -2.3149743e-18 -3.2661247e-17 1.5228078e-32 -8.1653118e-18)
(-2.8578591e-17 0.003723875 -4.2153076e-22 3.2661247e-17 -2.7728617e-36 8.1653118e-18)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(3.0535642e-05 -0.0037234955 -9.190286e-23 -3.4897876e-05 -6.4600882e-25 -8.7244691e-06)
(2.5291139e-06 -0.0037238724 -1.1576513e-18 -2.8904159e-06 -6.7391413e-22 -7.2260398e-07)
(-0.0001587656 -0.0037135917 -1.1537576e-18 0.0001814464 4.227952e-20 4.5361599e-05)
(-0.00044562843 -0.0036413686 -5.6435155e-19 0.00050928964 5.9198565e-20 0.00012732241)
(-0.00082107137 -0.0034276717 -5.3476996e-19 0.00093836729 1.0979989e-19 0.00023459182)
(-0.0012017858 -0.0030089753 -4.7385514e-19 0.0013734695 1.6222107e-19 0.00034336737)
(-0.0014756535 -0.0024083995 -3.7726342e-19 0.0016864611 1.9813161e-19 0.00042161528)
(-0.0015745678 -0.0017923765 0 0.001799506 0 0.00044987651)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
