04_Simulation/PH_2D_RANS_kOmegaSSTx/0/T07
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      T07;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
32000
(
(-0.0011542729 -6.0851481e-06 0 0.0011542729 0 0)
(-0.0011544004 -5.0401618e-07 -3.1336501e-22 0.0011544004 7.1773228e-19 4.4624001e-34)
(-0.0011509247 3.1615867e-05 1.964504e-20 0.0011509247 7.1514602e-19 4.4436776e-34)
(-0.0011265683 8.8267179e-05 2.7429665e-20 0.0011265683 3.5008927e-19 1.0879278e-34)
(-0.001055132 0.00015999064 4.9921753e-20 0.001055132 3.2923201e-19 1.0273e-34)
(-0.0009179948 0.00022616432 7.0496397e-20 0.0009179948 2.8614296e-19 8.9191998e-35)
(-0.00072826468 0.00026208591 8.2108394e-20 0.00072826468 2.2815665e-19 7.1478761e-35)
(-0.00054307188 0.0002598739 0 0.00054307188 0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(-0.0011544012 0 0 0.0011544012 7.1771536e-19 4.4621863e-34)
(-0.0011544012 0 0 0.0011544012 7.1774313e-19 4.4625316e-34)
(-0.0011544013 9.506483e-22 0 0.0011544013 0 0)
(-0.0011544013 9.5064883e-22 1.0397344e-43 0.0011544013 1.2625805e-25 1.3808972e-47)
(-0.0011544012 -9.5065041e-22 2.0183146e-43 0.0011544012 -2.4508956e-25 5.2034673e-47)
(-0.0011544012 0 0 0.0011544012 4.6789987e-25 1.8964835e-46)
(-0.0011544012 5.695305e-18 -3.5405282e-33 0.0011544012 -7.1764203e-19 4.4612745e-34)
(-0.0011544012 -5.695305e-18 6.4469034e-37 0.0011544012 -1.3067454e-22 1.479194e-41)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(-0.0011542729 -6.0851481e-06 -1.5019288e-25 0.0011542729 2.8489623e-23 7.0317736e-43)
(-0.0011544004 -5.0401618e-07 -1.56685e-22 0.0011544004 3.5887187e-19 1.1156356e-34)
(-0.0011509247 3.1615867e-05 9.8225792e-21 0.0011509247 3.5757516e-19 1.1109328e-34)
(-0.0011265683 8.8267179e-05 1.3679944e-20 0.0011265683 1.7459935e-19 2.7059994e-35)
(-0.001055132 0.00015999064 2.4961022e-20 0.001055132 1.6461697e-19 2.56828e-35)
(-0.0009179948 0.00022616432 3.5616486e-20 0.0009179948 1.4456634e-19 2.276639e-35)
(-0.00072826468 0.00026208591 4.1054413e-20 0.00072826468 1.1407893e-19 1.7869878e-35)
(-0.00054307188 0.0002598739 0 0.00054307188 0 0)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
