04_Simulation/PH_2D_RANS_kOmegaSSTx/0/T08
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      T08;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
32000
(
(-0.0011543014 -6.0852984e-06 0 0.0011543014 0 0)
(-0.0011544006 -5.0401626e-07 -3.1336506e-22 0.0011544006 7.177324e-19 4.4624008e-34)
(-0.0011516967 3.1637074e-05 1.9658217e-20 0.0011516967 7.156257e-19 4.4466582e-34)
(-0.0011327157 8.8748827e-05 2.7579341e-20 0.0011327157 3.5199961e-19 1.0938643e-34)
(-0.0010766961 0.00016326042 5.0942018e-20 0.0010766961 3.3596062e-19 1.0482952e-34)
(-0.00096752333 0.00023836655 7.4299886e-20 0.00096752333 3.0158121e-19 9.400417e-35)
(-0.00081210358 0.00029225762 9.1560833e-20 0.00081210358 2.5442238e-19 7.9707501e-35)
(-0.00065361087 0.00031276965 0 0.00065361087 0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(-0.0011544012 0 0 0.0011544012 7.1771536e-19 4.4621863e-34)
(-0.0011544012 0 0 0.0011544012 7.1774313e-19 4.4625316e-34)
(-0.0011544013 9.506483e-22 0 0.0011544013 0 0)
(-0.0011544013 9.5064883e-22 1.0397344e-43 0.0011544013 1.2625805e-25 1.3808972e-47)
(-0.0011544012 -9.5065041e-22 2.0183146e-43 0.0011544012 -2.4508956e-25 5.2034673e-47)
(-0.0011544012 0 0 0.0011544012 4.6789987e-25 1.8964835e-46)
(-0.0011544012 5.695305e-18 -3.5405282e-33 0.0011544012 -7.1764203e-19 4.4612745e-34)
(-0.0011544012 -5.695305e-18 6.4469034e-37 0.0011544012 -1.3067454e-22 1.479194e-41)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(-0.0011543014 -6.0852984e-06 -1.5019659e-25 0.0011543014 2.8490326e-23 7.0319474e-43)
(-0.0011544006 -5.0401626e-07 -1.5668503e-22 0.0011544006 3.5887193e-19 1.1156358e-34)
(-0.0011516967 3.1637074e-05 9.8291677e-21 0.0011516967 3.5781501e-19 1.1116779e-34)
(-0.0011327157 8.8748827e-05 1.3754592e-20 0.0011327157 1.7555208e-19 2.7207652e-35)
(-0.0010766961 0.00016326042 2.5471157e-20 0.0010766961 1.6798129e-19 2.6207687e-35)
(-0.00096752333 0.00023836655 3.75381e-20 0.00096752333 1.5236613e-19 2.3994704e-35)
(-0.00081210358 0.00029225762 4.5780657e-20 0.00081210358 1.2721186e-19 1.9927085e-35)
(-0.00065361087 0.00031276965 0 0.00065361087 0 0)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
