04_Simulation/PH_2D_RANS_kOmegaSSTx/0/T09
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      T09;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
32000
(
(-0.00038479091 4.0567654e-06 0 -0.00038474814 0 0.00076953905)
(-0.00038480035 3.3601078e-07 2.0891e-22 -0.00038480006 -7.1773234e-19 0.00076960041)
(-0.00038454221 -2.1077245e-05 -1.3096693e-20 -0.00038338423 -7.1538586e-19 0.00076792644)
(-0.00038269469 -5.8844786e-05 -1.8286444e-20 -0.00037347366 -3.5104444e-19 0.00075616835)
(-0.00037686871 -0.00010666043 -3.3281169e-20 -0.00034452267 -3.3259631e-19 0.00072139138)
(-0.00036378155 -0.00015077621 -4.6997598e-20 -0.00028948876 -2.9386208e-19 0.00065327031)
(-0.00034056694 -0.00017472394 -5.4738929e-20 -0.00021480859 -2.4128952e-19 0.00055537554)
(-0.00030998611 -0.00017324927 0 -0.00014417763 0 0.00045416374)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(-0.00038480042 0 0 -0.00038480042 -7.1771536e-19 0.00076960083)
(-0.00038480042 0 0 -0.00038480042 -7.1774313e-19 0.00076960083)
(-0.00038480042 -6.3376553e-22 0 -0.00038480042 0 0.00076960083)
(-0.00038480042 -6.3376589e-22 -6.9315625e-44 -0.00038480042 -1.2625805e-25 0.00076960083)
(-0.00038480042 6.3376694e-22 -1.3455431e-43 -0.00038480042 2.4508956e-25 0.00076960083)
(-0.00038480042 0 0 -0.00038480042 -4.6789987e-25 0.00076960083)
(-0.00038480042 -3.79687e-18 2.3603522e-33 -0.00038480042 7.1764203e-19 0.00076960083)
(-0.00038480042 3.79687e-18 -4.2979356e-37 -0.00038480042 1.3067454e-22 0.00076960083)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(-0.00038479091 4.0567654e-06 1.0012858e-25 -0.00038474814 -2.8489974e-23 0.00076953905)
(-0.00038480035 3.3601078e-07 1.0445667e-22 -0.00038480006 -3.588719e-19 0.00076960041)
(-0.00038454221 -2.1077245e-05 -6.5483861e-21 -0.00038338423 -3.5769508e-19 0.00076792644)
(-0.00038269469 -5.8844786e-05 -9.1199627e-21 -0.00037347366 -1.7507572e-19 0.00075616835)
(-0.00037686871 -0.00010666043 -1.6640681e-20 -0.00034452267 -1.6629913e-19 0.00072139138)
(-0.00036378155 -0.00015077621 -2.3744324e-20 -0.00028948876 -1.4846624e-19 0.00065327031)
(-0.00034056694 -0.00017472394 -2.7369609e-20 -0.00021480859 -1.2064539e-19 0.00055537554)
(-0.00030998611 -0.00017324927 0 -0.00014417763 0 0.00045416374)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
