04_Simulation/PH_2D_RANS_kOmegaSSTx/0/T10
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volSymmTensorField;
    location    "0";
    object      T10;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 0 0 0 0];

internalField   nonuniform List<symmTensor> 
32000
(
(6.2878116e-07 3.3148369e-09 0 -6.2878116e-07 0 0)
(5.2081662e-08 2.2739078e-11 1.4137704e-26 -5.2081662e-08 -3.2381045e-23 -2.0132461e-38)
(-3.2645105e-06 8.9676006e-08 5.5721664e-23 3.2645105e-06 2.0284574e-21 1.2604154e-36)
(-9.0654605e-06 7.1028326e-07 2.2072567e-22 9.0654605e-06 2.8171576e-21 8.7545212e-37)
(-1.6164882e-05 2.4510959e-06 7.648135e-22 1.6164882e-05 5.0439152e-21 1.5738488e-36)
(-2.2069139e-05 5.4371242e-06 1.6947751e-21 2.2069139e-05 6.8790461e-21 2.1442285e-36)
(-2.4136107e-05 8.6860365e-06 2.7212318e-21 2.4136107e-05 7.5615549e-21 2.3689451e-36)
(-2.2239665e-05 1.0642253e-05 0 2.2239665e-05 0 -0)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(0 0 0 0 0 0)
(0 0 0 0 0 0)
(9.8233657e-23 0 0 -9.8233657e-23 0 -0)
(9.8233713e-23 0 0 -9.8233713e-23 -1.0743922e-44 -1.1750737e-66)
(-9.8233876e-23 0 0 9.8233876e-23 -2.0855918e-44 4.4278951e-66)
(0 0 0 0 0 0)
(5.8851485e-19 0 0 -5.8851485e-19 3.6585458e-34 -2.2743619e-49)
(-5.8851485e-19 0 0 5.8851485e-19 -6.6618002e-38 7.5409452e-57)
...
)
;
    }
    hills
    {
        type            calculated;
        value           nonuniform List<symmTensor> 
200
(
(6.2878116e-07 3.3148369e-09 8.1816397e-29 -6.2878116e-07 -1.5519499e-26 -3.8305038e-46)
(5.2081662e-08 2.2739078e-11 7.0689647e-27 -5.2081662e-08 -1.6190781e-23 -5.0332761e-39)
(-3.2645105e-06 8.9676006e-08 2.7861e-23 3.2645105e-06 1.0142348e-21 3.1510765e-37)
(-9.0654605e-06 7.1028326e-07 1.1008209e-22 9.0654605e-06 1.4049956e-21 2.1775093e-37)
(-1.6164882e-05 2.4510959e-06 3.8240898e-22 1.6164882e-05 2.5219723e-21 3.934668e-37)
(-2.2069139e-05 5.4371242e-06 8.5624141e-22 2.2069139e-05 3.4754606e-21 5.4731751e-37)
(-2.4136107e-05 8.6860365e-06 1.360623e-21 2.4136107e-05 3.7807973e-21 5.922425e-37)
(-2.2239665e-05 1.0642253e-05 0 2.2239665e-05 0 -0)
...
)
;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
