04_Simulation/PH_2D_RANS_kOmegaSSTx/0/gradU
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.4.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volTensorField;
    location    "0";
    object      gradU;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 -1 0 0 0 0];

internalField   nonuniform List<tensor> 
32000
(
(-0.0090608039 0 0 1.7187159 0 0 0 0 0)
(-0.00075045154 0 0 1.7188368 0 0 1.0686627e-15 0 0)
(0.047206227 0 0 1.7184666 0 0 1.0677975e-15 0 0)
(0.13451597 0 0 1.7168491 0 0 5.3352331e-16 0 0)
(0.25977959 0 0 1.7132362 0 0 5.3457974e-16 0 0)
(0.42052372 0 0 1.7068943 0 0 5.3204635e-16 0 0)
(0.61075051 0 0 1.6971077 0 0 5.3168364e-16 0 0)
(0.80548997 0 0 1.6832739 0 0 0 0 0)
...
)
;

boundaryField
{
    inlet
    {
        type            cyclic;
    }
    outlet
    {
        type            cyclic;
    }
    top
    {
        type            zeroGradient;
    }
    hills
    {
        type            zeroGradient;
    }
    front
    {
        type            empty;
    }
    back
    {
        type            empty;
    }
}


// ************************************************************************* //
