04_Simulation/PH_2D_RANS_kOmegaSSTx/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p {
        solver          GAMG;
        smoother        GaussSeidel;
        cacheAgglomeration true;
        nCellsInCoarsestLevel 10;
        agglomerator    faceAreaPair;
        mergeLevels     1;
        tolerance       1e-05;
        relTol          0.05;
    }

    pFinal {
        $p;
        tolerance       1e-05;
        relTol          0.05;
    }

    "(U|k)"
    {
        solver          smoothSolver;
        smoother        GaussSeidel;
        nSweeps         2;
        tolerance       1e-07;
        relTol          0.01;
    }

    omega {
        $k;
        tolerance       1e-11;
    }

    "(U|k|omega)Final"
    {
        $U;
        tolerance       1e-12;
        relTol          0.01;
    }


}

PIMPLE
{
    nOuterCorrectors    1;
    nCorrectors         2;
    nNonOrthogonalCorrectors 0;
    pRefCell            0;
    pRefValue           0;
}


SIMPLE
{
    nNonOrthogonalCorrectors 0;
    nMonitorIter        2000;
    convFac             5.0;
    pRefCell            0;
    pRefValue           0;

    residualControl
    {
        p               1e-3;
        U               1e-5;
        k               1e-5;
        omega           1e-9;
    }
}

relaxationFactors
{
    fields
    {
        "p"               0.3; //0.2
    }
    equations
    {
        "U"           0.7;//0.3;
        "k"            0.7; //0.1;
        "omega"        0.7; // 0.1;
    }
}

// ************************************************************************* //
